{
    "easy_words": {
        "algorithm": "A set of instructions used to solve problems.",
        "binary": "A numeral system with a base of 2.",
        "compiler": "Translates human-readable code into machine code.",
        "database": "A structured collection of data.",
        "encryption": "Converts information into a secret code.",
        "function": "A block of reusable code that performs a task.",
        "hardware": "Physical components of a computer system.",
        "software": "Programs and applications that run on a computer.",
        "interface": "The point of interaction between humans and computers.",
        "memory": "Stores data temporarily for quick access.",
        "network": "Interconnected computers and devices.",
        "programming": "Writing instructions for a computer.",
        "terminal": "A text-based interface for interacting with a computer.",
        "variable": "Stores data and can change its value.",
        "abstraction": "Simplifies complex systems by focusing on essential details.",
        "analysis": "Examining and evaluating data to understand its structure.",
        "assembly": "A low-level programming language.",
        "iteration": "Repetition of a process in a computer program.",
        "machine": "A device that processes data according to instructions.",
        "module": "A self-contained unit of software.",
        "protocol": "Rules governing communication between computers.",
        "recursion": "A function calling itself to solve problems.",
        "unicode": "Standard character encoding system.",
        "validation": "Checking if something meets specific requirements.",
        "thread": "A unit of execution managed independently by a scheduler.",
        "waterfall": "A traditional approach to software development.",
        "agile": "An iterative approach to software development.",
        "property": "A characteristic of an object in programming.",
        "heuristic": "A practical problem-solving method.",
        "namespace": "Prevents naming conflicts in a program."
    },
    "medium_words": {
        "python": "A high-level programming language known for its simplicity.",
        "kernel": "The core component of an operating system.",
        "query": "Requests information from a database.",
        "cache": "Stores frequently accessed data for faster retrieval.",
        "syntax": "Rules governing how code is written in a programming language.",
        "valgrind": "A tool for debugging and profiling programs.",
        "makefile": "Contains instructions for compiling and building a program.",
        "swift": "A programming language developed by Apple.",
        "pixel": "The smallest unit of a digital image.",
        "server": "Provides services or resources to other computers.",
        "import": "Includes external modules or libraries into a program.",
        "export": "Makes a function, variable, or module available to other parts of a program.",
        "sprint": "A short, time-bound period for completing tasks.",
        "unit": "A self-contained module of a program.",
        "script": "A sequence of instructions executed by a computer.",
        "cipher": "Algorithm used for encryption and decryption.",
        "struct": "Groups related variables together under a single name.",
        "plugin": "Adds specific features to an existing application.",
        "switch": "Selects one of several code blocks to execute.",
        "source": "The human-readable form of a program's code.",
        "vector": "An array-like data structure used for mathematical operations.",
        "packet": "A unit of data transmitted over a network.",
        "method": "A function associated with an object in programming.",
        "object": "A self-contained entity consisting of data and procedures.",
        "socket": "An endpoint for sending or receiving data over a network.",
        "array": "A collection of elements stored in contiguous memory locations.",
        "alias": "An alternative name assigned to a variable or object.",
        "token": "A single unit of meaning in a programming language.",
        "index": "Points to a specific element in a data structure."
    },
    "hard_words": {
        "queue": "Stores and retrieves elements based on the First In, First Out principle.",
        "json": "A lightweight data interchange format.",
        "api": "Rules and protocols for building software applications.",
        "node": "A device, data point, or point of connection in a network.",
        "data": "Facts, figures, or statistics collected and analyzed.",
        "svg": "An XML-based image format for displaying vector graphics.",
        "loop": "Repeated sequence of instructions in a computer program.",
        "git": "Tracks changes in source code during software development.",
        "html": "Markup language for creating web pages and applications.",
        "xml": "Markup language for encoding documents.",
        "php": "Server-side scripting language for web development.",
        "http": "Protocol used for transferring hypertext requests and information.",
        "tcp": "One of the core protocols of the Internet protocol suite.",
        "udp": "Connectionless protocol used for data transmission.",
        "css": "Style sheet language for describing the presentation of web pages.",
        "bit": "Basic unit of data in computing and digital communications.",
        "byte": "Unit of digital information consisting of 8 bits.",
        "bash": "Command-line interpreter and scripting language.",
        "java": "High-level, object-oriented programming language.",
        "lint": "Analyzes source code for errors and stylistic inconsistencies.",
        "test": "Procedure for evaluating the quality of software.",
        "shell": "User interface for accessing operating system services.",
        "heap": "Memory used for dynamic memory allocation.",
        "link": "Navigational element connecting documents or parts of documents.",
        "graph": "Collection of nodes and edges representing relationships.",
        "hash": "Function mapping input data to fixed-size values.",
        "ram": "Memory used for storing active data.",
        "ssh": "Cryptographic network protocol for secure remote access.",
        "url": "Address used to access resources on the Internet.",
        "vim": "Highly configurable text editor."
    }
}
