{
    "easy_words": {
        "algorithm": "A step-by-step procedure or formula for solving a problem.",
        "binary": "A number system with a base of 2, using only 0 and 1.",
        "compiler": "A program that translates high-level programming code into machine code.",
        "database": "A structured set of data stored electronically.",
        "encryption": "The process of converting information into a code to prevent unauthorized access.",
        "function": "A named section of a program that performs a specific task.",
        "hardware": "The physical components of a computer system.",
        "software": "The programs and applications that run on a computer.",
        "interface": "The point of interaction between the user and the computer or between different systems.",
        "memory": "The component of a computer that stores data for short-term use.",
        "network": "A collection of interconnected computers and devices.",
        "programming": "The process of writing code to instruct a computer.",
        "terminal": "A text-based interface for interacting with a computer.",
        "variable": "A storage location identified by a memory address and an associated symbolic name.",
        "abstraction": "The process of simplifying complex systems to focus on relevant details.",
        "analysis": "The process of examining and evaluating data or information.",
        "assembly": "A low-level programming language with a strong correspondence between its instructions and the architecture's machine code instructions.",
        "iteration": "The repetition of a process or set of instructions in a computer program.",
        "machine": "A device consisting of interconnected components that manipulate data according to a set of instructions.",
        "module": "A self-contained unit of software that performs a specific task.",
        "protocol": "A set of rules or conventions governing communication between computers.",
        "recursion": "A programming technique in which a function calls itself directly or indirectly.",
        "unicode": "A standardized character encoding system.",
        "validation": "The process of checking if something complies with a certain set of rules or standards.",
        "thread": "The smallest sequence of programmed instructions that can be managed independently by a scheduler.",
        "waterfall": "A linear and sequential approach to software development.",
        "agile": "A flexible and iterative approach to software development.",
        "property": "A characteristic or attribute of an object in programming.",
        "heuristic": "A technique or method that efficiently solves a problem but is not guaranteed to be optimal or perfect.",
        "namespace": "A container that holds a set of identifiers to avoid naming conflicts between different parts of a program."
    },
    "medium_words": {
        "python": "A high-level programming language known for its readability and simplicity.",
        "kernel": "The core component of an operating system.",
        "query": "A request for data or information from a database.",
        "cache": "A hardware or software component that stores data to serve future requests more quickly.",
        "syntax": "The set of rules that dictate how programs written in a programming language are interpreted.",
        "unicode": "A standardized character encoding system.",
        "valgrind": "A programming tool for memory debugging, memory leak detection, and profiling.",
        "makefile": "A special file that contains rules on how to compile and link a program.",
        "swift": "A programming language developed by Apple for iOS, macOS, watchOS, and tvOS development.",
        "pixel": "The smallest unit of a digital image.",
        "server": "A computer or system that manages network resources and provides services to other computers.",
        "import": "In programming, the inclusion of external modules or libraries into a program.",
        "export": "In programming, making a function, variable, or module available to the outside world.",
        "sprint": "A short, time-boxed period during which a specific work has to be completed and made ready for review.",
        "unit": "A module of a program that represents a single coherent function.",
        "script": "A sequence of instructions written in a programming language for execution by a computer.",
        "cipher": "An algorithm for performing encryption or decryption.",
        "struct": "A composite data type in programming that groups variables under a single name.",
        "plugin": "A software component that adds specific features to an existing computer program.",
        "switch": "A control statement that selects one of many code blocks to be executed.",
        "source": "The human-readable version of a program's code.",
        "vector": "A dynamic array or a one-dimensional array in programming.",
        "packet": "A unit of data that travels across a network.",
        "method": "A function that is associated with an object in object-oriented programming.",
        "object": "A self-contained unit that consists of both data and procedures to manipulate the data.",
        "socket": "An endpoint for sending or receiving data across a computer network.",
        "array": "A collection of elements, each identified by an index or a key.",
        "alias": "An alternative name for a variable, function, or object.",
        "token": "A single unit of lexical meaning in a programming language.",
        "index": "A position or pointer pointing to a specific element in a data structure."
    },
    "hard_words": {
        "queue": "A data structure that follows the First In, First Out (FIFO) principle.",
        "json": "A lightweight data interchange format.",
        "api": "Application Programming Interface - a set of rules for building software applications.",
        "node": "In computing, a node can be a device or data point in a larger network.",
        "data": "Raw facts and statistics.",
        "svg": "Scalable Vector Graphics - an XML-based vector image format.",
        "loop": "A sequence of instructions that is continually repeated until a certain condition is reached.",
        "git": "A distributed version control system for tracking changes in source code during software development.",
        "html": "Hypertext Markup Language - the standard markup language for documents designed to be displayed in a web browser.",
        "xml": "eXtensible Markup Language - a markup language that defines rules for encoding documents in a format readable by both humans and machines.",
        "php": "Hypertext Preprocessor - a server-side scripting language widely used in web development.",
        "http": "Hypertext Transfer Protocol - the foundation of data communication on the World Wide Web.",
        "tcp": "Transmission Control Protocol - one of the main protocols in the Internet protocol suite.",
        "udp": "User Datagram Protocol - a connectionless protocol used for data transmission.",
        "css": "Cascading Style Sheets - a style sheet language used for describing the presentation of a document written in HTML.",
        "bit": "The basic unit of information in computing and digital communications.",
        "byte": "A unit of digital information that consists of 8 bits.",
        "bash": "Bourne Again SHell - a command processor that typically runs in a text window.",
        "java": "A high-level, class-based, object-oriented programming language.",
        "lint": "A tool that analyzes source code to flag programming errors, bugs, stylistic errors, and suspicious constructs.",
        "test": "A procedure intended to establish the quality, performance, or reliability of something.",
        "shell": "A user interface for access to an operating system's services.",
        "heap": "A region of a computer's memory used for dynamic memory allocation.",
        "link": "A reference or navigation element that allows you to navigate from one document to another or from one part of a document to another.",
        "graph": "A collection of nodes and edges that connect pairs of nodes in a network.",
        "hash": "A function that converts input data (or 'message') into a fixed-size string of bytes.",
        "ram": "Random Access Memory - a type of computer memory that is used to store data that is being actively used or processed.",
        "ssh": "Secure Shell - a cryptographic network protocol for operating network services securely over an unsecured network.",
        "url": "Uniform Resource Locator - a reference or address used to access resources on the internet.",
        "vim": "A highly configurable text editor often used for programming."
    }
}
